{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,39],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"face_morpher.position","class_name":"IdentityGrid2d","config":{"image_size":128,"name":"face_morpher.position","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"face_morpher.pose_image","class_name":"PoseToImageLayer","config":{"image_size":128,"name":"face_morpher.pose_image","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":3,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["face_morpher.position",0,0,{}],["face_morpher.pose_image",0,0,{}]]]},{"name":"siren.sine_layers.0.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.0.linear","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"siren.sine_layers.0.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.0.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.0.linear",0,0,{}]]]},{"name":"siren.sine_layers.0.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.0.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.0.scale",0,0,{}]]]},{"name":"siren.sine_layers.1.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.1.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.0.sine",0,0,{}]]]},{"name":"siren.sine_layers.1.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.1.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.1.linear",0,0,{}]]]},{"name":"siren.sine_layers.1.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.1.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.1.scale",0,0,{}]]]},{"name":"siren.sine_layers.2.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.2.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.1.sine",0,0,{}]]]},{"name":"siren.sine_layers.2.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.2.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.2.linear",0,0,{}]]]},{"name":"siren.sine_layers.2.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.2.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.2.scale",0,0,{}]]]},{"name":"siren.sine_layers.3.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.3.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.2.sine",0,0,{}]]]},{"name":"siren.sine_layers.3.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.3.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.3.linear",0,0,{}]]]},{"name":"siren.sine_layers.3.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.3.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.3.scale",0,0,{}]]]},{"name":"siren.sine_layers.4.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.4.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.3.sine",0,0,{}]]]},{"name":"siren.sine_layers.4.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.4.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.4.linear",0,0,{}]]]},{"name":"siren.sine_layers.4.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.4.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.4.scale",0,0,{}]]]},{"name":"siren.sine_layers.5.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.5.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.4.sine",0,0,{}]]]},{"name":"siren.sine_layers.5.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.5.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.5.linear",0,0,{}]]]},{"name":"siren.sine_layers.5.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.5.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.5.scale",0,0,{}]]]},{"name":"siren.sine_layers.6.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.6.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.5.sine",0,0,{}]]]},{"name":"siren.sine_layers.6.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.6.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.6.linear",0,0,{}]]]},{"name":"siren.sine_layers.6.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.6.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.6.scale",0,0,{}]]]},{"name":"siren.sine_layers.7.linear","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.sine_layers.7.linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.6.sine",0,0,{}]]]},{"name":"siren.sine_layers.7.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren.sine_layers.7.scale","trainable":true},"inbound_nodes":[[["siren.sine_layers.7.linear",0,0,{}]]]},{"name":"siren.sine_layers.7.sine","class_name":"SineLayer","config":{"name":"siren.sine_layers.7.sine","trainable":true},"inbound_nodes":[[["siren.sine_layers.7.scale",0,0,{}]]]},{"name":"siren.last_linear","class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren.last_linear","trainable":true},"inbound_nodes":[[["siren.sine_layers.7.sine",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["siren.last_linear",0,0]]},"keras_version":"tfjs-layers 4.9.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.9.0","convertedBy":null,"weightsManifest":[{"paths":["./face_morpher.weights.bin"],"weights":[{"name":"siren.sine_layers.0.linear/kernel","shape":[1,1,41,128],"dtype":"float32"},{"name":"siren.sine_layers.0.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.1.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.1.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.2.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.2.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.3.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.3.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.4.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.4.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.5.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.5.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.6.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.6.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.sine_layers.7.linear/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"siren.sine_layers.7.linear/bias","shape":[128],"dtype":"float32"},{"name":"siren.last_linear/kernel","shape":[1,1,128,4],"dtype":"float32"},{"name":"siren.last_linear/bias","shape":[4],"dtype":"float32"}]}]}