{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,512,512,4],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,45],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"0.position","class_name":"IdentityGrid2d","config":{"image_size":128,"name":"0.position","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"0.pose_image","class_name":"PoseToImageLayer","config":{"image_size":128,"name":"0.pose_image","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":3,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["0.position",0,0,{}],["0.pose_image",0,0,{}]]]},{"name":"siren_layers.0.0.linear","class_name":"Conv2D","config":{"filters":360,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.0.0.linear","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"siren_layers.0.0.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.0.0.scale","trainable":true},"inbound_nodes":[[["siren_layers.0.0.linear",0,0,{}]]]},{"name":"siren_layers.0.0.sine","class_name":"SineLayer","config":{"name":"siren_layers.0.0.sine","trainable":true},"inbound_nodes":[[["siren_layers.0.0.scale",0,0,{}]]]},{"name":"siren_layers.0.1.linear","class_name":"Conv2D","config":{"filters":360,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.0.1.linear","trainable":true},"inbound_nodes":[[["siren_layers.0.0.sine",0,0,{}]]]},{"name":"siren_layers.0.1.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.0.1.scale","trainable":true},"inbound_nodes":[[["siren_layers.0.1.linear",0,0,{}]]]},{"name":"siren_layers.0.1.sine","class_name":"SineLayer","config":{"name":"siren_layers.0.1.sine","trainable":true},"inbound_nodes":[[["siren_layers.0.1.scale",0,0,{}]]]},{"name":"siren_layers.0.2.linear","class_name":"Conv2D","config":{"filters":180,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.0.2.linear","trainable":true},"inbound_nodes":[[["siren_layers.0.1.sine",0,0,{}]]]},{"name":"siren_layers.0.2.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.0.2.scale","trainable":true},"inbound_nodes":[[["siren_layers.0.2.linear",0,0,{}]]]},{"name":"siren_layers.0.2.sine","class_name":"SineLayer","config":{"name":"siren_layers.0.2.sine","trainable":true},"inbound_nodes":[[["siren_layers.0.2.scale",0,0,{}]]]},{"name":"1.position","class_name":"IdentityGrid2d","config":{"image_size":256,"name":"1.position","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"grid_sample_GridSample1","class_name":"GridSample","config":{"name":"grid_sample_GridSample1","trainable":true},"inbound_nodes":[[["siren_layers.0.2.sine",0,0,{}],["1.position",0,0,{}]]]},{"name":"1.pose_image","class_name":"PoseToImageLayer","config":{"image_size":256,"name":"1.pose_image","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":3,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["grid_sample_GridSample1",0,0,{}],["1.position",0,0,{}],["1.pose_image",0,0,{}]]]},{"name":"siren_layers.1.0.linear","class_name":"Conv2D","config":{"filters":180,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.1.0.linear","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"siren_layers.1.0.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.1.0.scale","trainable":true},"inbound_nodes":[[["siren_layers.1.0.linear",0,0,{}]]]},{"name":"siren_layers.1.0.sine","class_name":"SineLayer","config":{"name":"siren_layers.1.0.sine","trainable":true},"inbound_nodes":[[["siren_layers.1.0.scale",0,0,{}]]]},{"name":"siren_layers.1.1.linear","class_name":"Conv2D","config":{"filters":180,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.1.1.linear","trainable":true},"inbound_nodes":[[["siren_layers.1.0.sine",0,0,{}]]]},{"name":"siren_layers.1.1.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.1.1.scale","trainable":true},"inbound_nodes":[[["siren_layers.1.1.linear",0,0,{}]]]},{"name":"siren_layers.1.1.sine","class_name":"SineLayer","config":{"name":"siren_layers.1.1.sine","trainable":true},"inbound_nodes":[[["siren_layers.1.1.scale",0,0,{}]]]},{"name":"siren_layers.1.2.linear","class_name":"Conv2D","config":{"filters":90,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.1.2.linear","trainable":true},"inbound_nodes":[[["siren_layers.1.1.sine",0,0,{}]]]},{"name":"siren_layers.1.2.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.1.2.scale","trainable":true},"inbound_nodes":[[["siren_layers.1.2.linear",0,0,{}]]]},{"name":"siren_layers.1.2.sine","class_name":"SineLayer","config":{"name":"siren_layers.1.2.sine","trainable":true},"inbound_nodes":[[["siren_layers.1.2.scale",0,0,{}]]]},{"name":"2.position","class_name":"IdentityGrid2d","config":{"image_size":512,"name":"2.position","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"grid_sample_GridSample2","class_name":"GridSample","config":{"name":"grid_sample_GridSample2","trainable":true},"inbound_nodes":[[["siren_layers.1.2.sine",0,0,{}],["2.position",0,0,{}]]]},{"name":"2.pose_image","class_name":"PoseToImageLayer","config":{"image_size":512,"name":"2.pose_image","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":3,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["grid_sample_GridSample2",0,0,{}],["2.position",0,0,{}],["2.pose_image",0,0,{}]]]},{"name":"siren_layers.2.0.linear","class_name":"Conv2D","config":{"filters":90,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.2.0.linear","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"siren_layers.2.0.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.2.0.scale","trainable":true},"inbound_nodes":[[["siren_layers.2.0.linear",0,0,{}]]]},{"name":"siren_layers.2.0.sine","class_name":"SineLayer","config":{"name":"siren_layers.2.0.sine","trainable":true},"inbound_nodes":[[["siren_layers.2.0.scale",0,0,{}]]]},{"name":"siren_layers.2.1.linear","class_name":"Conv2D","config":{"filters":90,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.2.1.linear","trainable":true},"inbound_nodes":[[["siren_layers.2.0.sine",0,0,{}]]]},{"name":"siren_layers.2.1.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.2.1.scale","trainable":true},"inbound_nodes":[[["siren_layers.2.1.linear",0,0,{}]]]},{"name":"siren_layers.2.1.sine","class_name":"SineLayer","config":{"name":"siren_layers.2.1.sine","trainable":true},"inbound_nodes":[[["siren_layers.2.1.scale",0,0,{}]]]},{"name":"siren_layers.2.2.linear","class_name":"Conv2D","config":{"filters":90,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"siren_layers.2.2.linear","trainable":true},"inbound_nodes":[[["siren_layers.2.1.sine",0,0,{}]]]},{"name":"siren_layers.2.2.scale","class_name":"Rescaling","config":{"scale":30,"offset":0,"name":"siren_layers.2.2.scale","trainable":true},"inbound_nodes":[[["siren_layers.2.2.linear",0,0,{}]]]},{"name":"siren_layers.2.2.sine","class_name":"SineLayer","config":{"name":"siren_layers.2.2.sine","trainable":true},"inbound_nodes":[[["siren_layers.2.2.scale",0,0,{}]]]},{"name":"last_linear","class_name":"Conv2D","config":{"filters":7,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"last_linear","trainable":true},"inbound_nodes":[[["siren_layers.2.2.sine",0,0,{}]]]},{"name":"siren_morpher03split_layer_SirenMorpher03SplitLayer1","class_name":"SirenMorpher03SplitLayer","config":{"image_channels":4,"name":"siren_morpher03split_layer_SirenMorpher03SplitLayer1","trainable":true},"inbound_nodes":[[["last_linear",0,0,{}]]]},{"name":"identity_grid2d_IdentityGrid2d1","class_name":"IdentityGrid2d","config":{"image_size":512,"name":"identity_grid2d_IdentityGrid2d1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["identity_grid2d_IdentityGrid2d1",0,0,{}],["siren_morpher03split_layer_SirenMorpher03SplitLayer1",0,0,{}]]]},{"name":"grid_sample_GridSample3","class_name":"GridSample","config":{"name":"grid_sample_GridSample3","trainable":true},"inbound_nodes":[[["input1",0,0,{}],["add_Add1",0,0,{}]]]},{"name":"local_image_change_layer_LocalImageChangeLayer1","class_name":"LocalImageChangeLayer","config":{"name":"local_image_change_layer_LocalImageChangeLayer1","trainable":true},"inbound_nodes":[[["siren_morpher03split_layer_SirenMorpher03SplitLayer1",0,1,{}],["siren_morpher03split_layer_SirenMorpher03SplitLayer1",0,2,{}],["grid_sample_GridSample3",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0]],"output_layers":[["local_image_change_layer_LocalImageChangeLayer1",0,0],["siren_morpher03split_layer_SirenMorpher03SplitLayer1",0,1],["siren_morpher03split_layer_SirenMorpher03SplitLayer1",0,2],["grid_sample_GridSample3",0,0],["siren_morpher03split_layer_SirenMorpher03SplitLayer1",0,0]]},"keras_version":"tfjs-layers 4.9.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.9.0","convertedBy":null,"weightsManifest":[{"paths":["./body_morpher.weights.bin"],"weights":[{"name":"siren_layers.0.0.linear/kernel","shape":[1,1,47,360],"dtype":"float32"},{"name":"siren_layers.0.0.linear/bias","shape":[360],"dtype":"float32"},{"name":"siren_layers.0.1.linear/kernel","shape":[1,1,360,360],"dtype":"float32"},{"name":"siren_layers.0.1.linear/bias","shape":[360],"dtype":"float32"},{"name":"siren_layers.0.2.linear/kernel","shape":[1,1,360,180],"dtype":"float32"},{"name":"siren_layers.0.2.linear/bias","shape":[180],"dtype":"float32"},{"name":"siren_layers.1.0.linear/kernel","shape":[1,1,227,180],"dtype":"float32"},{"name":"siren_layers.1.0.linear/bias","shape":[180],"dtype":"float32"},{"name":"siren_layers.1.1.linear/kernel","shape":[1,1,180,180],"dtype":"float32"},{"name":"siren_layers.1.1.linear/bias","shape":[180],"dtype":"float32"},{"name":"siren_layers.1.2.linear/kernel","shape":[1,1,180,90],"dtype":"float32"},{"name":"siren_layers.1.2.linear/bias","shape":[90],"dtype":"float32"},{"name":"siren_layers.2.0.linear/kernel","shape":[1,1,137,90],"dtype":"float32"},{"name":"siren_layers.2.0.linear/bias","shape":[90],"dtype":"float32"},{"name":"siren_layers.2.1.linear/kernel","shape":[1,1,90,90],"dtype":"float32"},{"name":"siren_layers.2.1.linear/bias","shape":[90],"dtype":"float32"},{"name":"siren_layers.2.2.linear/kernel","shape":[1,1,90,90],"dtype":"float32"},{"name":"siren_layers.2.2.linear/bias","shape":[90],"dtype":"float32"},{"name":"last_linear/kernel","shape":[1,1,90,7],"dtype":"float32"},{"name":"last_linear/bias","shape":[7],"dtype":"float32"}]}]}